Tekla Open API Reference for Tekla Structures 2025
AnalysisModelAnalysisProperties.AnalysisMethod Property
 The analysis method.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelAnalysisProperties.AnalysisMethodEnum AnalysisMethod { get; set; }
Public Property AnalysisMethod As AnalysisModelAnalysisProperties.AnalysisMethodEnum
	Get
	Set
Property Value
Type: AnalysisModelAnalysisProperties.AnalysisMethodEnum
See Also
Reference
AnalysisModelAnalysisProperties Class
Tekla.Structures.Analysis Namespace